## Import libraries

In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
import plotly.express as px
import os

# matplotlib defaults
plt.style.use("seaborn-whitegrid")
plt.rc("figure", autolayout=True)
plt.rc(
    "axes",
    labelweight="bold",
    labelsize="large",
    titleweight="bold",
    titlesize=14,
    titlepad=10,
)

C:\Users\pklet\AppData\Local\Temp\ipykernel_13748\448939022.py:10: MatplotlibDeprecationWarning: The seaborn styles shipped by Matplotlib are deprecated since 3.6, as they no longer correspond to the styles shipped by seaborn. However, they will remain available as 'seaborn-v0_8-<style>'. Alternatively, directly use the seaborn API instead.
  plt.style.use("seaborn-whitegrid")

In [2]:
 # Importinf data sets
    
path = r'C:\\Users\\pklet\\OneDrive\\Petar\\University Rankings Data_Task 6'

In [3]:
df_rank = pd.read_csv(os.path.join(path, 'THE_World_Universities_2016-2023_rankings.csv'), index_col = False)

In [4]:
df_rank.head()

,rank,name,location,scores_overall,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,Year
0,1,California Institute of Technology,United States,95.2,99.8,97.8,64.0,97.6,95.6,"2,243",6.9,26%,33 : 67,2016
1,2,University of Oxford,United Kingdom,94.2,98.8,73.1,94.4,98.9,86.5,"19,920",11.6,34%,46:54:00,2016
2,3,Stanford University,United States,93.9,99.9,63.3,76.3,96.2,92.5,"15,596",7.8,22%,42:58:00,2016
3,4,University of Cambridge,United Kingdom,92.8,97.0,55.0,91.5,96.7,88.2,"18,810",11.8,34%,46:54:00,2016
4,5,Massachusetts Institute of Technology,United States,92,99.7,95.4,84.0,88.6,89.4,"11,074",9.0,33%,37 : 63,2016

In [5]:
df_spending = pd.read_csv(os.path.join(path, 'Exp_public_privat_ education.csv'), index_col = False)

In [6]:
df_spending.head()

  LOCATION  INDICATOR SUBJECT MEASURE FREQUENCY  TIME     Value
0      AUS  EDUPUBEXP     TRY  PC_GDP         A  2000  0.744540
1      AUS  EDUPUBEXP     TRY  PC_GDP         A  2005  0.689385
2      AUS  EDUPUBEXP     TRY  PC_GDP         A  2008  0.689400
3      AUS  EDUPUBEXP     TRY  PC_GDP         A  2009  0.734759
4      AUS  EDUPUBEXP     TRY  PC_GDP         A  2010  0.778470

# Cleaning and Wrangling

In [7]:
df_rank.describe()

,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_student_staff_ratio,Year
count,10526.000000,10526.000000,10526.000000,10526.000000,10526.000000,11521.000000,11522.000000
mean,29.936823,25.504019,48.432310,44.976363,45.906983,18.939849,2020.275820
std,16.531236,18.818761,27.680549,17.615227,22.993406,17.579755,2.234057
min,1.200000,0.000000,0.700000,0.000000,7.900000,0.300000,2016.000000
25%,18.700000,11.800000,23.600000,35.300000,26.300000,12.300000,2018.000000
50%,24.400000,19.200000,46.100000,39.000000,41.200000,16.400000,2021.000000
75%,35.200000,32.800000,72.100000,48.600000,61.100000,22.100000,2022.000000
max,100.000000,100.000000,100.000000,100.000000,100.000000,865.800000,2023.000000

In [8]:
df_rank.shape

(11522, 14)

In [9]:
df_rank.count()

rank                            11522
name                            11522
location                        11522
scores_overall                  10526
scores_citations                10526
scores_industry_income          10526
scores_international_outlook    10526
scores_research                 10526
scores_teaching                 10526
stats_number_students           11522
stats_student_staff_ratio       11521
stats_pc_intl_students          11522
stats_female_male_ratio         10995
Year                            11522
dtype: int64

In [10]:
df_rank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11522 entries, 0 to 11521
Data columns (total 14 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   rank                          11522 non-null  object
 1   name                          11522 non-null  object
 2   location                      11522 non-null  object
 3   scores_overall                10526 non-null  object
 4   scores_citations              10526 non-null  float64
 5   scores_industry_income        10526 non-null  float64
 6   scores_international_outlook  10526 non-null  float64
 7   scores_research               10526 non-null  float64
 8   scores_teaching               10526 non-null  float64
 9   stats_number_students         11522 non-null  object
 10  stats_student_staff_ratio     11521 non-null  float64
 11  stats_pc_intl_students        11522 non-null  object
 12  stats_female_male_ratio       10995 non-null  object
 13  Year                          11522 non-null  int64
dtypes: float64(6), int64(1), object(7)
memory usage: 1.2+ MB

In [11]:
df_rank['scores_overall'].value_counts(dropna=False)

NaN          996
0            600
10.3–25.0    525
10.6–22.3    461
10.7–22.1    396
            ...
91.8           1
91.1           1
88.6           1
74.7           1
71.8           1
Name: scores_overall, Length: 476, dtype: int64

In [12]:
for col in df_rank.columns.tolist():
  weird = (df_rank[[col]].applymap(type) != df_rank[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_rank[weird]) > 0:
    print (col)

scores_overall
stats_female_male_ratio

In [13]:
df_rank['scores_overall'] = df_rank['scores_overall'].astype('str')

In [14]:
df_rank['scores_citations'] = df_rank['scores_citations'].astype('str')

In [15]:
df_rank['scores_industry_income'] = df_rank['scores_industry_income'].astype('str')

In [16]:
df_rank['scores_international_outlook'] = df_rank['scores_international_outlook'].astype('str')

In [17]:
df_rank['rank'] = df_rank['rank'].astype('str')

In [18]:
df_rank['scores_research'] = df_rank['scores_research'].astype('str')

In [19]:
df_rank['scores_teaching'] = df_rank['scores_teaching'].astype('str')

In [20]:
df_rank['stats_number_students'] = df_rank['stats_number_students'].astype('str')

In [21]:
df_rank['stats_student_staff_ratio'] = df_rank['stats_student_staff_ratio'].astype('str')

In [22]:
df_rank['stats_pc_intl_students'] = df_rank['stats_pc_intl_students'].astype('str')

In [23]:
df_rank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11522 entries, 0 to 11521
Data columns (total 14 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   rank                          11522 non-null  object
 1   name                          11522 non-null  object
 2   location                      11522 non-null  object
 3   scores_overall                11522 non-null  object
 4   scores_citations              11522 non-null  object
 5   scores_industry_income        11522 non-null  object
 6   scores_international_outlook  11522 non-null  object
 7   scores_research               11522 non-null  object
 8   scores_teaching               11522 non-null  object
 9   stats_number_students         11522 non-null  object
 10  stats_student_staff_ratio     11522 non-null  object
 11  stats_pc_intl_students        11522 non-null  object
 12  stats_female_male_ratio       10995 non-null  object
 13  Year                          11522 non-null  int64
dtypes: int64(1), object(13)
memory usage: 1.2+ MB

In [24]:
df_rank.isnull().sum()

rank                              0
name                              0
location                          0
scores_overall                    0
scores_citations                  0
scores_industry_income            0
scores_international_outlook      0
scores_research                   0
scores_teaching                   0
stats_number_students             0
stats_student_staff_ratio         0
stats_pc_intl_students            0
stats_female_male_ratio         527
Year                              0
dtype: int64

In [25]:
df_rank.head()

,rank,name,location,scores_overall,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,Year
0,1,California Institute of Technology,United States,95.2,99.8,97.8,64.0,97.6,95.6,"2,243",6.9,26%,33 : 67,2016
1,2,University of Oxford,United Kingdom,94.2,98.8,73.1,94.4,98.9,86.5,"19,920",11.6,34%,46:54:00,2016
2,3,Stanford University,United States,93.9,99.9,63.3,76.3,96.2,92.5,"15,596",7.8,22%,42:58:00,2016
3,4,University of Cambridge,United Kingdom,92.8,97.0,55.0,91.5,96.7,88.2,"18,810",11.8,34%,46:54:00,2016
4,5,Massachusetts Institute of Technology,United States,92,99.7,95.4,84.0,88.6,89.4,"11,074",9.0,33%,37 : 63,2016

In [26]:
df_rank['stats_female_male_ratio'] = df_rank['stats_female_male_ratio'].str.rstrip(':00')

In [27]:
df_rank.head()

,rank,name,location,scores_overall,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,Year
0,1,California Institute of Technology,United States,95.2,99.8,97.8,64.0,97.6,95.6,"2,243",6.9,26%,33 : 67,2016
1,2,University of Oxford,United Kingdom,94.2,98.8,73.1,94.4,98.9,86.5,"19,920",11.6,34%,46:54,2016
2,3,Stanford University,United States,93.9,99.9,63.3,76.3,96.2,92.5,"15,596",7.8,22%,42:58,2016
3,4,University of Cambridge,United Kingdom,92.8,97.0,55.0,91.5,96.7,88.2,"18,810",11.8,34%,46:54,2016
4,5,Massachusetts Institute of Technology,United States,92,99.7,95.4,84.0,88.6,89.4,"11,074",9.0,33%,37 : 63,2016

In [28]:
df_rank[['female_ratio', 'male_ratio']] = df_rank['stats_female_male_ratio'].str.split(':', expand=True)

In [29]:
df_rank.head()

,rank,name,location,scores_overall,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,Year,female_ratio,male_ratio
0,1,California Institute of Technology,United States,95.2,99.8,97.8,64.0,97.6,95.6,"2,243",6.9,26%,33 : 67,2016,33,67
1,2,University of Oxford,United Kingdom,94.2,98.8,73.1,94.4,98.9,86.5,"19,920",11.6,34%,46:54,2016,46,54
2,3,Stanford University,United States,93.9,99.9,63.3,76.3,96.2,92.5,"15,596",7.8,22%,42:58,2016,42,58
3,4,University of Cambridge,United Kingdom,92.8,97.0,55.0,91.5,96.7,88.2,"18,810",11.8,34%,46:54,2016,46,54
4,5,Massachusetts Institute of Technology,United States,92,99.7,95.4,84.0,88.6,89.4,"11,074",9.0,33%,37 : 63,2016,37,63

In [30]:
df_rank.rename(columns = {'stats_pc_intl_students' : 'stats_intl_students_%'}, inplace = True)

In [31]:
df_rank.rename(columns = {'female_ratio' : 'female_%'}, inplace = True)

In [32]:
df_rank.rename(columns = {'male_ratio' : 'male_%'}, inplace = True)

In [33]:
df_rank['scores_overall'].value_counts(dropna=False)

nan          996
0            600
10.3–25.0    525
10.6–22.3    461
10.7–22.1    396
            ...
91.8           1
91.1           1
88.6           1
74.7           1
71.8           1
Name: scores_overall, Length: 476, dtype: int64

In [34]:
df_rank['female_%'].value_counts(dropna=False)

55             534
NaN            527
56             513
53             497
57             496
              ...
88               1
99               1
0.274305556      1
0.233333333      1
85               1
Name: female_%, Length: 94, dtype: int64

In [35]:
# Droping Column
df_spending.drop(columns = ['FREQUENCY'])

     LOCATION   INDICATOR SUBJECT MEASURE  TIME     Value
0         AUS   EDUPUBEXP     TRY  PC_GDP  2000  0.744540
1         AUS   EDUPUBEXP     TRY  PC_GDP  2005  0.689385
2         AUS   EDUPUBEXP     TRY  PC_GDP  2008  0.689400
3         AUS   EDUPUBEXP     TRY  PC_GDP  2009  0.734759
4         AUS   EDUPUBEXP     TRY  PC_GDP  2010  0.778470
...       ...         ...     ...     ...   ...       ...
4980      ROU  EDUPRIVEXP     SRY  PC_GDP  2016  0.009614
4981      ROU  EDUPRIVEXP     SRY  PC_GDP  2017  0.008390
4982      ROU  EDUPRIVEXP     SRY  PC_GDP  2018  0.008427
4983      ROU  EDUPRIVEXP     SRY  PC_GDP  2019  0.007973
4984      ROU  EDUPRIVEXP     SRY  PC_GDP  2020  0.005315

[4985 rows x 6 columns]

In [36]:
# Rename Columns
df_spending.rename(columns = {'LOCATION' : 'Country'}, inplace = True)

In [37]:
df_spending.rename(columns = {'INDICATOR' : 'Spending_Indicator'}, inplace = True)

In [38]:
df_spending.rename(columns = {'SUBJECT' : 'Type od Education'}, inplace = True)

In [39]:
df_spending.rename(columns = {'MEASURE' : 'Measuring Spending'}, inplace = True)

In [40]:
df_spending.rename(columns = {'TIME' : 'Year'}, inplace = True)

In [41]:
#Replacing name of values
df_spending['Country'] = df_spending['Country'].str.replace('AUS', 'Australia')

In [42]:
df_spending['Country'] = df_spending['Country'].str.replace('ARG', 'Argentina')

In [43]:
df_spending['Country'] = df_spending['Country'].str.replace('AUT', 'Austria')

In [44]:
df_spending['Country'] = df_spending['Country'].str.replace('BEL', 'Belgium')

In [45]:
df_spending['Country'] = df_spending['Country'].str.replace('BGR', 'Bulgaria')

In [46]:
df_spending['Country'] = df_spending['Country'].str.replace('BRA', 'Brazil')

In [47]:
df_spending['Country'] = df_spending['Country'].str.replace('CAN', 'Canada')

In [48]:
df_spending['Country'] = df_spending['Country'].str.replace('CHE', 'Switzerland')

In [49]:
df_spending['Country'] = df_spending['Country'].str.replace('CHL', 'Chile')

In [50]:
df_spending['Country'] = df_spending['Country'].str.replace('COL', 'Columbia')

In [51]:
df_spending['Country'] = df_spending['Country'].str.replace('CRI', 'Costa Rica')

In [52]:
df_spending['Country'] = df_spending['Country'].str.replace('CZE', 'Czech Republic')

In [53]:
df_spending['Country'] = df_spending['Country'].str.replace('DEU', 'Germany')

In [54]:
df_spending['Country'] = df_spending['Country'].str.replace('DNK', 'Denmark')

In [55]:
df_spending['Country'] = df_spending['Country'].str.replace('ESP', 'Spain')

In [56]:
df_spending['Country'] = df_spending['Country'].str.replace('EST', 'Estonia')

In [57]:
df_spending['Country'] = df_spending['Country'].str.replace('FIN', 'Finland')

In [58]:
df_spending['Country'] = df_spending['Country'].str.replace('FRA', 'France')

In [59]:
df_spending['Country'] = df_spending['Country'].str.replace('GBR', 'United Kingdom')

In [60]:
df_spending['Country'] = df_spending['Country'].str.replace('GRC', 'Greece')

In [61]:
df_spending['Country'] = df_spending['Country'].str.replace('HRV', 'Croatia')

In [62]:
df_spending['Country'] = df_spending['Country'].str.replace('HUN', 'Hungary')

In [63]:
df_spending['Country'] = df_spending['Country'].str.replace('IDN', 'India')

In [64]:
df_spending['Country'] = df_spending['Country'].str.replace('IRL', 'Ireland')

In [65]:
df_spending['Country'] = df_spending['Country'].str.replace('ISL', 'Iceland')

In [66]:
df_spending['Country'] = df_spending['Country'].str.replace('ISR', 'Israel')

In [67]:
df_spending['Country'] = df_spending['Country'].str.replace('ITA', 'Italy')

In [68]:
df_spending['Country'] = df_spending['Country'].str.replace('JPN', 'Japan')

In [69]:
df_spending['Country'] = df_spending['Country'].str.replace('KOR', 'South Korea')

In [70]:
df_spending['Country'] = df_spending['Country'].str.replace('LTU', 'Lithuania')

In [71]:
df_spending['Country'] = df_spending['Country'].str.replace('LUX', 'Luxembourg')

In [72]:
df_spending['Country'] = df_spending['Country'].str.replace('LVA', 'Latvia')

In [73]:
df_spending['Country'] = df_spending['Country'].str.replace('MEX', 'Mexico')

In [74]:
df_spending['Country'] = df_spending['Country'].str.replace('NLD', 'Netherlands')

In [75]:
df_spending['Country'] = df_spending['Country'].str.replace('NOR', 'Norway')

In [76]:
df_spending['Country'] = df_spending['Country'].str.replace('NZL', 'New Zealand')

In [77]:
df_spending['Country'] = df_spending['Country'].str.replace('PER', 'Peru')

In [78]:
df_spending['Country'] = df_spending['Country'].str.replace('POL', 'Poland')

In [79]:
df_spending['Country'] = df_spending['Country'].str.replace('PRT', 'Portugal')

In [80]:
df_spending['Country'] = df_spending['Country'].str.replace('ROU', 'Romania')

In [81]:
df_spending['Country'] = df_spending['Country'].str.replace('RUS', 'Russian Federation')

In [82]:
df_spending['Country'] = df_spending['Country'].str.replace('SVK', 'Slovak Republic')

In [83]:
df_spending['Country'] = df_spending['Country'].str.replace('SVN', 'Slovenia')

In [84]:
df_spending['Country'] = df_spending['Country'].str.replace('SWE', 'Sweden')

In [85]:
df_spending['Country'] = df_spending['Country'].str.replace('TUR', 'Turkey')

In [86]:
df_spending['Country'] = df_spending['Country'].str.replace('USA', 'United States')

In [87]:
df_spending['Country'] = df_spending['Country'].str.replace('ZAF', 'South Africa')

In [88]:
df_spending['Spending_Indicator'] = df_spending['Spending_Indicator'].str.replace('EDUPUBEXP', 'Public spending on education')

In [89]:
df_spending['Spending_Indicator'] = df_spending['Spending_Indicator'].str.replace('EDUPRIVEXP', 'Private spending on education')

In [90]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('TRY', 'Tertiary')

In [91]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('PRY_NTRY', 'Primary to post-secondary non-tertiary')

In [92]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('PRY', 'Primary')

In [93]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('PRY_TRY', 'Primary to tertiary')

In [94]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('EARLYCHILDEDU', 'Early childhood education')

In [95]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('PRY', 'Primary')

In [96]:
df_spending['Type od Education'] = df_spending['Type od Education'].str.replace('PRY', 'Secondary')

In [97]:
df_spending['Measuring Spending'] = df_spending['Measuring Spending'].str.replace('PC_GDP', '% of GDP')

In [98]:
df_rank['scores_overall'] = df_rank['scores_overall'].str.replace('n/a', '0')

In [99]:
df_rank['scores_citations'] = df_rank['scores_citations'].str.replace('n/a', '0')

In [100]:
df_rank['scores_industry_income'] = df_rank['scores_industry_income'].str.replace('n/a', '0')

In [101]:
df_rank['scores_international_outlook'] = df_rank['scores_international_outlook'].str.replace('n/a', '0')

In [102]:
df_rank['scores_research'] = df_rank['scores_research'].str.replace('n/a', '0')

In [103]:
#replace factors with numeric

df_rank['scores_teaching'] = df_rank['scores_teaching'].astype(float)

In [104]:
df_rank['scores_citations'] = df_rank['scores_citations'].astype(float)

In [105]:
df_rank['scores_research'] = df_rank['scores_research'].astype(float)

In [106]:
df_rank['scores_international_outlook'] = df_rank['scores_international_outlook'].astype(float)

In [107]:
df_rank['scores_industry_income'] = df_rank['scores_industry_income'].astype(float)

## Data Consistency Checks

In [108]:
# Checking for Mixed-Type Data

for col in df_rank.columns.tolist():
  weird = (df_rank[[col]].applymap(type) != df_rank[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_rank[weird]) > 0:
    print (col)

stats_female_male_ratio
female_%
male_%

In [109]:
df_rank['stats_female_male_ratio'] = df_rank['stats_female_male_ratio'].astype('str')

In [110]:
df_rank['female_%'] = df_rank['female_%'].astype('str')

In [111]:
df_rank['male_%'] = df_rank['male_%'].astype('str')

In [112]:
for col in df_rank.columns.tolist():
  weird = (df_rank[[col]].applymap(type) != df_rank[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_rank[weird]) > 0:
    print (col)

In [113]:
# Checking for Missing Values

df_rank.isnull().sum()

rank                              0
name                              0
location                          0
scores_overall                    0
scores_citations                996
scores_industry_income          996
scores_international_outlook    996
scores_research                 996
scores_teaching                 996
stats_number_students             0
stats_student_staff_ratio         0
stats_intl_students_%             0
stats_female_male_ratio           0
Year                              0
female_%                          0
male_%                            0
dtype: int64

In [114]:
df_spending.isnull().sum()

Country               0
Spending_Indicator    0
Type od Education     0
Measuring Spending    0
FREQUENCY             0
Year                  0
Value                 0
dtype: int64

In [115]:
# Checking for Duplicates
df_rank_dups = df_rank[df_rank.duplicated()]

In [116]:
df_spending_dups = df_spending[df_spending.duplicated()]

In [117]:
df_spending.describe()

              Year        Value
count  4985.000000  4985.000000
mean   2012.842728     4.238668
std       5.647673    90.393085
min    1995.000000     0.000000
25%    2010.000000     0.169392
50%    2014.000000     0.525967
75%    2017.000000     2.406744
max    2020.000000  4586.290000

In [118]:
df_rank.count()

rank                            11522
name                            11522
location                        11522
scores_overall                  11522
scores_citations                10526
scores_industry_income          10526
scores_international_outlook    10526
scores_research                 10526
scores_teaching                 10526
stats_number_students           11522
stats_student_staff_ratio       11522
stats_intl_students_%           11522
stats_female_male_ratio         11522
Year                            11522
female_%                        11522
male_%                          11522
dtype: int64

In [119]:
df_rank = df_rank.replace(pd.NA, 0)

In [120]:
df_rank.count()

rank                            11522
name                            11522
location                        11522
scores_overall                  11522
scores_citations                10526
scores_industry_income          10526
scores_international_outlook    10526
scores_research                 10526
scores_teaching                 10526
stats_number_students           11522
stats_student_staff_ratio       11522
stats_intl_students_%           11522
stats_female_male_ratio         11522
Year                            11522
female_%                        11522
male_%                          11522
dtype: int64

In [121]:
df_rank.describe()

,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,Year
count,10526.000000,10526.000000,10526.000000,10526.000000,10526.000000,11522.000000
mean,29.936823,25.504019,48.432310,44.976363,45.906983,2020.275820
std,16.531236,18.818761,27.680549,17.615227,22.993406,2.234057
min,1.200000,0.000000,0.700000,0.000000,7.900000,2016.000000
25%,18.700000,11.800000,23.600000,35.300000,26.300000,2018.000000
50%,24.400000,19.200000,46.100000,39.000000,41.200000,2021.000000
75%,35.200000,32.800000,72.100000,48.600000,61.100000,2022.000000
max,100.000000,100.000000,100.000000,100.000000,100.000000,2023.000000

In [122]:
df_rank = df_rank.replace(pd.NA, None)

In [123]:
df_rank = df_rank.replace(pd.NA,-1)

In [124]:
df_rank['scores_overall'] = pd.to_numeric(df_rank['scores_overall'], errors='coerce').fillna(df_rank['scores_overall'])

In [125]:
print(df_rank[df_rank['scores_teaching'].isnull()])

           rank                                        name         location  \
8727   Reporter                Université 8 Mai 1945 Guelma          Algeria
8728   Reporter  University Abdelhamid Ibn Badis Mostaganem          Algeria
8729   Reporter                     Abdullah Gül University           Turkey
8730   Reporter                          Abertay University   United Kingdom
8731   Reporter                         Ada Kent University  Northern Cyprus
...         ...                                         ...              ...
11517  Reporter                     York St John University   United Kingdom
11518  Reporter         Yusuf Maitama Sule University, Kano          Nigeria
11519  Reporter       Zhytomyr Polytechnic State University          Ukraine
11520  Reporter                         Ziauddin University         Pakistan
11521  Reporter                            Zarqa University           Jordan

      scores_overall  scores_citations  scores_industry_income  \
8727             nan               NaN                     NaN
8728             nan               NaN                     NaN
8729             nan               NaN                     NaN
8730             nan               NaN                     NaN
8731             nan               NaN                     NaN
...              ...               ...                     ...
11517            nan               NaN                     NaN
11518            nan               NaN                     NaN
11519            nan               NaN                     NaN
11520            nan               NaN                     NaN
11521            nan               NaN                     NaN

       scores_international_outlook  scores_research  scores_teaching  \
8727                            NaN              NaN              NaN
8728                            NaN              NaN              NaN
8729                            NaN              NaN              NaN
8730                            NaN              NaN              NaN
8731                            NaN              NaN              NaN
...                             ...              ...              ...
11517                           NaN              NaN              NaN
11518                           NaN              NaN              NaN
11519                           NaN              NaN              NaN
11520                           NaN              NaN              NaN
11521                           NaN              NaN              NaN

      stats_number_students stats_student_staff_ratio stats_intl_students_%  \
8727                 16,105                      18.4                    1%
8728                 24,635                      19.3                    1%
8729                  1,958                      14.0                    9%
8730                  3,915                      21.2                   21%
8731                    640                       7.5                   21%
...                     ...                       ...                   ...
11517                 6,315                      18.6                   12%
11518                12,880                      33.0                    0%
11519                 3,869                      15.4                    1%
11520                 4,906                       8.8                    1%
11521                 5,768                      18.1                   32%

      stats_female_male_ratio  Year female_% male_%
8727                    69:31  2022       69     31
8728                    66:34  2022       66     34
8729                  38 : 62  2022      38      62
8730                    48:52  2022       48     52
8731                  34 : 66  2022      34      66
...                       ...   ...      ...    ...
11517                   65:35  2023       65     35
11518                   48:52  2023       48     52
11519                 34 : 66  2023      34      66
11520                   63:37  2023       63     37
11521                   47:53  2023       47     53

[996 rows x 16 columns]

In [126]:
# Change float to int

df_rank = df_rank.dropna()

In [127]:
df_rank['scores_teaching'] = df_rank['scores_teaching'].astype(int)

In [128]:
df_rank['scores_citations'] = df_rank['scores_citations'].astype(int)

In [129]:
df_rank['scores_research'] = df_rank['scores_research'].astype(int)

In [130]:
df_rank['scores_industry_income'] = df_rank['scores_industry_income'].astype(int)

In [131]:
df_rank['scores_international_outlook'] = df_rank['scores_international_outlook'].astype(int)

In [132]:
df_rank.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10526 entries, 0 to 10975
Data columns (total 16 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   rank                          10526 non-null  object
 1   name                          10526 non-null  object
 2   location                      10526 non-null  object
 3   scores_overall                10526 non-null  object
 4   scores_citations              10526 non-null  int32
 5   scores_industry_income        10526 non-null  int32
 6   scores_international_outlook  10526 non-null  int32
 7   scores_research               10526 non-null  int32
 8   scores_teaching               10526 non-null  int32
 9   stats_number_students         10526 non-null  object
 10  stats_student_staff_ratio     10526 non-null  object
 11  stats_intl_students_%         10526 non-null  object
 12  stats_female_male_ratio       10526 non-null  object
 13  Year                          10526 non-null  int64
 14  female_%                      10526 non-null  object
 15  male_%                        10526 non-null  object
dtypes: int32(5), int64(1), object(10)
memory usage: 1.2+ MB

In [133]:
df_rank['Year'] = df_rank['Year'].astype(str)

In [134]:
df_rank['stats_intl_students_%'] = df_rank['stats_intl_students_%'].str.rstrip('%')

In [135]:
df_rank['stats_number_students'] = df_rank['stats_number_students'].str.replace(',', '.')

In [136]:
df_rank['scores_overall'] = pd.to_numeric(df_rank['scores_overall'], errors='coerce').fillna(df_rank['scores_overall'])

In [137]:
df_rank['stats_student_staff_ratio'] = df_rank['stats_student_staff_ratio'].astype('float')

In [138]:
df_rank['male_%'] = df_rank['male_%'].str.rstrip('none')

In [139]:
df_rank['male_%'] = df_rank['male_%'].str.rstrip('na')

In [140]:
df_rank.head()

,rank,name,location,scores_overall,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_number_students,stats_student_staff_ratio,stats_intl_students_%,stats_female_male_ratio,Year,female_%,male_%
0,1,California Institute of Technology,United States,95.2,99,97,64,97,95,2.243,6.9,26,33 : 67,2016,33,67
1,2,University of Oxford,United Kingdom,94.2,98,73,94,98,86,19.920,11.6,34,46:54,2016,46,54
2,3,Stanford University,United States,93.9,99,63,76,96,92,15.596,7.8,22,42:58,2016,42,58
3,4,University of Cambridge,United Kingdom,92.8,97,55,91,96,88,18.810,11.8,34,46:54,2016,46,54
4,5,Massachusetts Institute of Technology,United States,92.0,99,95,84,88,89,11.074,9.0,33,37 : 63,2016,37,63

In [141]:
df_spending.head()

,Country,Spending_Indicator,Type od Education,Measuring Spending,FREQUENCY,Year,Value
0,Australia,Public spending on education,Tertiary,% of GDP,A,2000,0.744540
1,Australia,Public spending on education,Tertiary,% of GDP,A,2005,0.689385
2,Australia,Public spending on education,Tertiary,% of GDP,A,2008,0.689400
3,Australia,Public spending on education,Tertiary,% of GDP,A,2009,0.734759
4,Australia,Public spending on education,Tertiary,% of GDP,A,2010,0.778470

In [142]:
df_rank.rename(columns = {'location' : 'Country'}, inplace = True)

In [143]:
df_spending['Year'] = df_spending['Year'].astype(str)

In [144]:
df_rank.head()

,rank,name,Country,scores_overall,scores_citations,scores_industry_income,scores_international_outlook,scores_research,scores_teaching,stats_number_students,stats_student_staff_ratio,stats_intl_students_%,stats_female_male_ratio,Year,female_%,male_%
0,1,California Institute of Technology,United States,95.2,99,97,64,97,95,2.243,6.9,26,33 : 67,2016,33,67
1,2,University of Oxford,United Kingdom,94.2,98,73,94,98,86,19.920,11.6,34,46:54,2016,46,54
2,3,Stanford University,United States,93.9,99,63,76,96,92,15.596,7.8,22,42:58,2016,42,58
3,4,University of Cambridge,United Kingdom,92.8,97,55,91,96,88,18.810,11.8,34,46:54,2016,46,54
4,5,Massachusetts Institute of Technology,United States,92.0,99,95,84,88,89,11.074,9.0,33,37 : 63,2016,37,63

In [148]:
df_rank.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10526 entries, 0 to 10975
Data columns (total 16 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   rank                          10526 non-null  object
 1   name                          10526 non-null  object
 2   Country                       10526 non-null  object
 3   scores_overall                10526 non-null  object
 4   scores_citations              10526 non-null  int32
 5   scores_industry_income        10526 non-null  int32
 6   scores_international_outlook  10526 non-null  int32
 7   scores_research               10526 non-null  int32
 8   scores_teaching               10526 non-null  int32
 9   stats_number_students         10526 non-null  object
 10  stats_student_staff_ratio     10526 non-null  float64
 11  stats_intl_students_%         10526 non-null  object
 12  stats_female_male_ratio       10526 non-null  object
 13  Year                          10526 non-null  object
 14  female_%                      10526 non-null  object
 15  male_%                        10526 non-null  object
dtypes: float64(1), int32(5), object(10)
memory usage: 1.2+ MB

In [149]:
df_spending.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4985 entries, 0 to 4984
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             4985 non-null   object
 1   Spending_Indicator  4985 non-null   object
 2   Type od Education   4985 non-null   object
 3   Measuring Spending  4985 non-null   object
 4   FREQUENCY           4985 non-null   object
 5   Year                4985 non-null   object
 6   Value               4985 non-null   float64
dtypes: float64(1), object(6)
memory usage: 272.7+ KB

In [150]:
df_spending.drop(columns = ['FREQUENCY'])

,Country,Spending_Indicator,Type od Education,Measuring Spending,Year,Value
0,Australia,Public spending on education,Tertiary,% of GDP,2000,0.744540
1,Australia,Public spending on education,Tertiary,% of GDP,2005,0.689385
2,Australia,Public spending on education,Tertiary,% of GDP,2008,0.689400
3,Australia,Public spending on education,Tertiary,% of GDP,2009,0.734759
4,Australia,Public spending on education,Tertiary,% of GDP,2010,0.778470
...,...,...,...,...,...,...
4980,Romania,Private spending on education,SRY,% of GDP,2016,0.009614
4981,Romania,Private spending on education,SRY,% of GDP,2017,0.008390
4982,Romania,Private spending on education,SRY,% of GDP,2018,0.008427
4983,Romania,Private spending on education,SRY,% of GDP,2019,0.007973
4984,Romania,Private spending on education,SRY,% of GDP,2020,0.005315

In [151]:
df_rank.to_csv(os.path.join(path, 'THE_World_Universities_2016-2023_rankings_clean.csv'))

In [152]:
df_spending.to_csv(os.path.join(path, 'Exp_public_privat_ education_clean.csv'))